#include <iostream>
using namespace std;
//功能：7.17 包含多个递归调用的递归
//时间：2020年11月26日14:47:58
// 
//const int Len = 130;   //2^7 + 2 = 130
//const int Divs = 7;
//void subdivide(char ar[], int low, int high, int level);
//
//int main()
//{
//	char ruler[Len];
//	int i;
//	for ( i = 0; i < Len - 2; i++)
//	{
//		ruler[i] = ' ';
//	}
//	ruler[Len - 1] = '\0';
//	int max = Len - 2;
//	int min = 0;
//	ruler[min] = ruler[max] = '|';
//	cout << ruler << endl;
//	for (int i = 0; i <= Divs; i++)
//	{
//		subdivide(ruler, min, max, i);
//		cout << ruler << endl;
//		for (int j = 1; j < Len - 2; j++)
//		{
//			ruler[j] = ' ';
//		}
//	}
//
//	system("pause");
//	return 0;
//}
//
//void subdivide(char ar[], int low, int high, int level)
//{
//	if (level == 0)
//	{
//		return;
//	}
//	int mid = (high + low) / 2;
//	ar[mid] = '|';
//	subdivide(ar, low, mid, level - 1);
//	subdivide(ar, mid, high, level - 1);
//}

/*
在x86编译环境下，运行结果如下：（每一个指针占用了四个字节的大小）
|                               |
|                               |
|               |               |
|       |       |       |       |
|   |   |   |   |   |   |   |   |
| | | | | | | | | | | | | | | | |
|||||||||||||||||||||||||||||||||
请按任意键继续. . .
|                                                               |
|                                                               |
|                               |                               |
|               |               |               |               |
|       |       |       |       |       |       |       |       |
|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | |
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
请按任意键继续. . .

|                                                                                                                               |
|                                                                                                                               |
|                                                               |                                                               |
|                               |                               |                               |                               |
|               |               |               |               |               |               |               |               |
|       |       |       |       |       |       |       |       |       |       |       |       |       |       |       |       |
|   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
| | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | | |
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
请按任意键继续. . .
-------------------------------------------------------------------------
在x64编译环境下，运行结果如下：（每一个指针占用了八个字节的大小）
*/