#include <iostream>
//功能：4.18 使用new关键字来创建动态数组（动态分配内存）
//时间：2020年11月24日16:49:14

//int main()
//{
//	using namespace std;
//	
//	double * p3 = new double[3];
//	p3[0] = 0.2;
//	p3[1] = 0.5;
//	p3[2] = 0.8;
//	cout << "p3[1] is " << p3[1] << endl;
//	cout << "当前时刻p3指向的地址为：" << p3 << endl;
//	p3 = p3 + 1;                                          //000001AF41AFE330->000001AF41AFE338,移动了double，即八个字节的位置
//	cout << "将p3的值加一后，指向的地址为：" << p3 << endl;
//	cout << "Now p3[0] is " << p3[0] << " and " << "p3[1] is " << p3[1] << endl;
//	p3 = p3 - 1;
//	cout << "将p3的值减一后，指向的地址为：" << p3 << endl;
//	delete[] p3;
//
//	system("pause");
//	return 0;
//}

/*
-------------------------------------------------------------------------
在x64编译环境下，运行结果如下：（每一个指针占用了八个字节的大小）
p3[1] is 0.5
当前时刻p3指向的地址为：000001AF41AFE330
将p3的值加一后，指向的地址为：000001AF41AFE338
Now p3[0] is 0.5 and p3[1] is 0.8
将p3的值减一后，指向的地址为：000001AF41AFE330
请按任意键继续. . .
*/