#include <iostream>
#include <vector>
#include <array>
using namespace std;
//功能：4.24 比较数组、vector对象、array对象
//时间：2020年11月24日20:52:27
//array对象和数组存储在相同的内存区域中（栈），而vector对象存储在另一个区域中（堆）
int main()
{
	double a1[4] = { 1.2, 2.4, 3.6, 4.8 };
	vector<double> a2(4);
	a2[0] = 1.0 / 3.0;
	a2[1] = 1.0 / 5.0;
	a2[2] = 1.0 / 7.0;
	a2[3] = 1.0 / 9.0;

	array<double, 4> a3 = { 3.14, 2.72, 1.62, 1.41 };
	array<double, 4> a4;
	a4 = a3;

	cout << "a1[2]: " << a1[2] << " at " << &a1[2] << endl;
	cout << "a2[2]: " << a2[2] << " at " << &a2[2] << endl;
	cout << "a3[2]: " << a3[2] << " at " << &a3[2] << endl;
	cout << "a4[2]: " << a4[2] << " at " << &a4[2] << endl;

	a1[-2] = 20.2;   //相当于*（a1-2）
	cout << "a1[-2]: " << a1[-2] << " at " << &a1[-2] << endl;
	cout << "a3[2]: " << a3[2] << " at " << &a3[2] << endl;
	cout << "a4[2]: " << a4[2] << " at " << &a4[2] << endl;

	system("pause");
	return 0;
}

/*
在x86编译环境下，运行结果如下：（每一个指针占用了四个字节的大小）
a1[2]: 3.6 at 00EFFDF4
a2[2]: 0.142857 at 011DD9B0
a3[2]: 1.62 at 00EFFDB4
a4[2]: 1.62 at 00EFFD8C
a1[-2]: 20.2 at 00EFFDD4
a3[2]: 1.62 at 00EFFDB4
a4[2]: 1.62 at 00EFFD8C
请按任意键继续. . .
-------------------------------------------------------------------------
在x64编译环境下，运行结果如下：（每一个指针占用了八个字节的大小）
a1[2]: 3.6 at 0000004F94EFF468
a2[2]: 0.142857 at 000001712747F910
a3[2]: 1.62 at 0000004F94EFF4E8
a4[2]: 1.62 at 0000004F94EFF528
a1[-2]: 20.2 at 0000004F94EFF448
a3[2]: 1.62 at 0000004F94EFF4E8
a4[2]: 1.62 at 0000004F94EFF528
请按任意键继续. . .
*/